<a href="https://colab.research.google.com/github/alexsandro-matias/lab_dio/blob/main/aula04_Trabalhando_arquivos_Excel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Utilizando Arquivo do Excel para Análise de Dados

## Lendo os arquivos e depois mesclando-os

In [42]:
import pandas as pd

In [43]:
df1 = pd.read_excel("/content/Aracaju.xlsx")
df2 = pd.read_excel("/content/Fortaleza.xlsx")
df3 = pd.read_excel("/content/Natal.xlsx")
df4 = pd.read_excel("/content/Recife.xlsx")
df5 = pd.read_excel("/content/Salvador.xlsx")

Mesclando as coleções de Dados

In [44]:
df = pd.concat([df1,df2,df3,df4,df5])

In [45]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [46]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

Para uma amostragem aleatória do dataframe.

In [47]:
df.sample(10)

        Cidade       Data  Vendas  LojaID  Qtde
51      Recife 2019-01-01  146.95     982     2
194   Salvador 2019-01-02  156.47    1035     1
80       Natal 2018-05-23  264.00     852     3
16   Fortaleza 2019-01-01   97.32    1002     5
80      Recife 2019-01-01  114.14     982     8
69     Aracaju 2018-01-01   15.81    1523     1
109     Recife 2019-03-02   18.90     982     6
132      Natal 2019-01-02   19.61    1036     2
132   Salvador 2019-03-02   19.61    1036     2
27      Recife 2019-01-01   22.25     980     7

Neste exemplo, como os ID's das lojas não sofrerão nenhum cálculo, esses serão convertidos para o tipo texto.

In [48]:
df['LojaID'] = df['LojaID'].astype("object")

Para testar o efeito, verificaremos o tipo dos ID's:

In [49]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

# Verificando valores nulos ou faltantes

Primeiramente, verificando os valores faltantes:

In [50]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [51]:
df.loc[df['Vendas'] != 0]

       Cidade       Data  Vendas LojaID  Qtde
0     Aracaju 2018-01-01  142.00   1520     1
1     Aracaju 2018-01-01   14.21   1522     6
2     Aracaju 2018-01-01   71.55   1520     1
3     Aracaju 2018-01-01    3.01   1521     7
4     Aracaju 2018-01-01   24.51   1522     8
..        ...        ...     ...    ...   ...
235  Salvador 2019-01-03   41.84   1034     1
236  Salvador 2019-01-03  126.29   1035     3
237  Salvador 2019-01-03   38.06   1036     3
238  Salvador 2019-01-03  139.64   1035     1
239  Salvador 2019-01-03  161.41   1037     3

[894 rows x 5 columns]

In [58]:
df.sample(100)

        Cidade       Data  Vendas LojaID  Qtde
17      Recife 2019-02-14  142.45    981     3
80       Natal 2018-05-23  264.00    852     3
97      Recife 2019-01-01  153.04    983     4
188      Natal 2019-01-02  178.11   1035     3
98    Salvador 2019-01-01  231.76   1036     3
..         ...        ...     ...    ...   ...
51   Fortaleza 2019-01-01   30.47   1005     3
162   Salvador 2019-01-02   23.08   1036     2
163   Salvador 2019-01-02   17.66   1036     3
46   Fortaleza 2019-01-01    6.45   1003     3
219   Salvador 2019-01-02   19.67   1037     2

[100 rows x 5 columns]